Revit 2026 API

# PanelTypeSetIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public PanelTypeSetIterator()
```
```vb
Public Sub New
```
```cpp
public:
PanelTypeSetIterator()
```
```fsharp
new : unit -> PanelTypeSetIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

PanelTypeSetIterator Class

Autodesk.Revit.DB Namespace